In [135]:
import pandas as pd

In [136]:
data1 = {'Name': ['Joey Pasta'],
        'School': ['Hello']}

df1 = pd.DataFrame(data1)
df1.head()

         Name School
0  Joey Pasta  Hello

In [137]:
data2 = {'Date': ['10/2/2011', '11/2/2011', '12/2/2011', '13/2/2011'],
       'Event': ['Music', 'Poetry', 'Theatre', 'Comedy'], 
        'Cost': [10000, 5000, 15000, 2000]}

df2 = pd.DataFrame(data2)
df2.head(10)

        Date    Event   Cost
0  10/2/2011    Music  10000
1  11/2/2011   Poetry   5000
2  12/2/2011  Theatre  15000
3  13/2/2011   Comedy   2000

In [138]:
df2['Location'] = ['Madrid', 'New York', 'LA', 'London']
df2.head(10)

        Date    Event   Cost  Location
0  10/2/2011    Music  10000    Madrid
1  11/2/2011   Poetry   5000  New York
2  12/2/2011  Theatre  15000        LA
3  13/2/2011   Comedy   2000    London

In [139]:
df2['NumGuest'], df2['Performer'] = [10, 20, 30, 40], ['John', 'Patrick', 'Sam', 'Adel']
df2.head(10)

        Date    Event   Cost  Location  NumGuest Performer
0  10/2/2011    Music  10000    Madrid        10      John
1  11/2/2011   Poetry   5000  New York        20   Patrick
2  12/2/2011  Theatre  15000        LA        30       Sam
3  13/2/2011   Comedy   2000    London        40      Adel

In [140]:
# Remove Performer Column

df2 = df2.drop(columns=['Performer'])
df2.head(10)

        Date    Event   Cost  Location  NumGuest
0  10/2/2011    Music  10000    Madrid        10
1  11/2/2011   Poetry   5000  New York        20
2  12/2/2011  Theatre  15000        LA        30
3  13/2/2011   Comedy   2000    London        40

In [141]:
# Remove Cost and NumGuest Columns

df2 = df2.drop(columns=['Cost', 'NumGuest'])
df2.head(10)

        Date    Event  Location
0  10/2/2011    Music    Madrid
1  11/2/2011   Poetry  New York
2  12/2/2011  Theatre        LA
3  13/2/2011   Comedy    London

In [142]:
# Rename Event Column to Genre Column
# We can rename multiple columns using python dictionary

df2 = df2.rename(columns={'Event': 'Genre'})
df2.head(10)

        Date    Genre  Location
0  10/2/2011    Music    Madrid
1  11/2/2011   Poetry  New York
2  12/2/2011  Theatre        LA
3  13/2/2011   Comedy    London

In [143]:
newData = {'Date': '15/2/2011', 'Genre': 'K-Pop'}
df2 = df2.append(newData, ignore_index=True)
df2.head(10)

        Date    Genre  Location
0  10/2/2011    Music    Madrid
1  11/2/2011   Poetry  New York
2  12/2/2011  Theatre        LA
3  13/2/2011   Comedy    London
4  15/2/2011    K-Pop       NaN

In [144]:
df3 = pd.DataFrame({'Date': ['10/3/2012', '11/3/2012'],
                    'Genre': ['Mathematics', 'Physics'],
                   'Location': ['Japan', 'Spain']})
df3.head(10)

        Date        Genre Location
0  10/3/2012  Mathematics    Japan
1  11/3/2012      Physics    Spain

In [145]:
concated = pd.concat([df2,df3], ignore_index=True)
concated.head(10)

        Date        Genre  Location
0  10/2/2011        Music    Madrid
1  11/2/2011       Poetry  New York
2  12/2/2011      Theatre        LA
3  13/2/2011       Comedy    London
4  15/2/2011        K-Pop       NaN
5  10/3/2012  Mathematics     Japan
6  11/3/2012      Physics     Spain

In [146]:
df4 = pd.DataFrame({'Gender': ['Male', 'Female'],
                   'School': ['China', 'England']})
df4.head()

   Gender   School
0    Male    China
1  Female  England

In [147]:
tryconcat = pd.concat([concated,df4], ignore_index=True)
tryconcat.head(20)

        Date        Genre  Location  Gender   School
0  10/2/2011        Music    Madrid     NaN      NaN
1  11/2/2011       Poetry  New York     NaN      NaN
2  12/2/2011      Theatre        LA     NaN      NaN
3  13/2/2011       Comedy    London     NaN      NaN
4  15/2/2011        K-Pop       NaN     NaN      NaN
5  10/3/2012  Mathematics     Japan     NaN      NaN
6  11/3/2012      Physics     Spain     NaN      NaN
7        NaN          NaN       NaN    Male    China
8        NaN          NaN       NaN  Female  England

In [148]:
tryconcat = tryconcat.drop([0,1,5], axis=0)
tryconcat.head(20)

        Date    Genre Location  Gender   School
2  12/2/2011  Theatre       LA     NaN      NaN
3  13/2/2011   Comedy   London     NaN      NaN
4  15/2/2011    K-Pop      NaN     NaN      NaN
6  11/3/2012  Physics    Spain     NaN      NaN
7        NaN      NaN      NaN    Male    China
8        NaN      NaN      NaN  Female  England

In [149]:
tryconcat = tryconcat[3:]
tryconcat.head(20)

        Date    Genre Location  Gender   School
6  11/3/2012  Physics    Spain     NaN      NaN
7        NaN      NaN      NaN    Male    China
8        NaN      NaN      NaN  Female  England

In [150]:
tryconcat = tryconcat[0:2]
tryconcat.head()

        Date    Genre Location Gender School
6  11/3/2012  Physics    Spain    NaN    NaN
7        NaN      NaN      NaN   Male  China

In [151]:
tryconcat.set_index('Date', inplace=True)

In [152]:
tryconcat.head()

             Genre Location Gender School
Date
11/3/2012  Physics    Spain    NaN    NaN
NaN            NaN      NaN   Male  China

In [153]:
tryconcat = tryconcat.drop('11/3/2012', axis=0)
tryconcat.head()

     Genre Location Gender School
Date
NaN    NaN      NaN   Male  China

In [154]:
data = {'Date': ['10/2/2011', '11/2/2011', '12/2/2011', '13/2/2011'],
       'Event': ['Music', 'Poetry', 'Theatre', 'Comedy'], 
        'Cost': [10000, 5000, 15000, 2000]}

df = pd.DataFrame(data)
df.head(10)

        Date    Event   Cost
0  10/2/2011    Music  10000
1  11/2/2011   Poetry   5000
2  12/2/2011  Theatre  15000
3  13/2/2011   Comedy   2000

In [155]:
df.iloc[:3,1]

0      Music
1     Poetry
2    Theatre
Name: Event, dtype: object

In [156]:
df.loc[0,'Date']

'10/2/2011'

In [157]:
df.set_index('Date', inplace=True)
df.head()

             Event   Cost
Date
10/2/2011    Music  10000
11/2/2011   Poetry   5000
12/2/2011  Theatre  15000
13/2/2011   Comedy   2000

In [158]:
df.loc['11/2/2011', 'Cost']

5000

In [159]:
df.iloc[:2,0]

Date
10/2/2011     Music
11/2/2011    Poetry
Name: Event, dtype: object